% Page119：已知传递函数，分析主导极点，并比较新系统与原系统的单位阶跃响应
clear;
clc;

% 原系统的增益
K = 147.3;
% 仿真时间
t = 0:0.1:6;
num0 = K*[1, 1.5];
% 传递函数分母的系数
den00 = [1, 2, 5];
den01 = [1, 10, 26];
den02 = [1, 1.7];
% 建立原系统传递函数
sys0 = tf(num0, conv(den00, conv(den01, den02)));
% 求原系统的阶跃响应
y0 = step(sys0, t);
num1 = 5;
% 建立主导极点所构成的系统传递函数
sys1 = tf(num1, den00);
% 求取主导极点所构成的系统的阶跃响应
y1 = step(sys1, t);
% 绘制阶跃响应曲线并添加栅格
plot(t, y0, t, y1); grid;
% 添加图标题
title('阶跃响应对比');
% 放置区别两条曲线的文字注释
gtext('原系统的单位阶跃响应');
gtext('主导极点构成的系统的单位阶跃响应');


