% Page253：已知状态空间模型，求解脉冲响应、阶跃响应、响应曲线
clear;
clc;

A = [-2 -2.5 -0.5; 1 0 0; 0 1 0];
B = [1; 0; 0];
C = [0 1.5 1];
D = [];
% 建立状态空间模型
G = ss(A,B,C,D);
% 仿真时间
t = [0:0.1:20]';
% 计算脉冲响应并添加栅格
% impulse(G); grid on
% 计算阶跃响应并添加栅格
% step(G); grid on

% 接着输入如下代码
% 初始状态
xo = [1; 0; 2];
% 输入量 u
u(1, 1:20) = 2*ones(1, 20);
u(1, 21:201) = 0.5*ones(1, 181);
% 计算输入响应
[y, t, x] = lsim(G, u, t, xo);
% 绘制曲线
plot(t,x(:,1),'-', t,x(:,2),'--', t,x(:,3),'-.')
% 添加坐标轴
xlabel('时间/秒'); ylabel('幅值');
% 添加栅格
grid
% 添加标注
text(6, 0.3, 'x_1(t)');
text(6, -0.5, 'x_2(t)');
text(8, 1.8, 'x_3(t)');

figure(2)
plot(t,y)